The process described in https://github.com/cloudflare/terraform-provider-cloudflare/issues/2464#issuecomment-1563875923 worked in order to update the version. However, when I made any change on an existing rule, seems that it wants to update all the rule IDs:
```
  # module.zone.cloudflare_ruleset.ratelimiting_rules["test"] will be updated in-place
  ~ resource "cloudflare_ruleset" "ratelimiting_rules" {
        id          = "34567186311149fda17dc7721e248552"
        name        = "jt-stg-platform-ruleset-zone-ratelimiting-rules"
        # (4 unchanged attributes hidden)

      ~ rules {
          ~ id           = "efa92f51a42f410cb08797cda051924c" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "8" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ expression   = "{expr-from}" -> "{expr-to}"
          ~ id           = "13c19992b24e474e8c8d54854d08fd33" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "4" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "0f6de47a26c04b2db8343916edc74b66" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "10" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "3bd0f57149b44b7cb9c759db162c25be" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "1" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "5692fe6ee32448b7b408c16188e5cef3" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "3" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }
```
which seems the same problem present in #2172 . Seems that changes done in #2271 made that this problem re-appear (also the comment `It's not 100% the same so we'll need to do a bit of investigation how to best approach it.` helped to detect this regression problem).